/*
В какую переменную будет присвоено значение?

Каков будет результат выполнения этого кода?
*/

var value = 0;

function f() {
  if (1) {
    value = true;
  } else {
    var value = false;
  }

  alert( value );
}

f();

/*
Изменится ли внешняя переменная value ?

P.S. Какими будут ответы, если из строки var value = false убрать var?
*/

/*
Ответ:

Выведется true, но внешняя переменная не изменится. это из-за того, что в функции определяется своя локальная value 
(var value = false), хоть до этого блока выполнение и не доходит.
Если же из строки var value = false убрать var, тоже выведется true, но изменится значение внешней переменной.
*/