/*
Ввод числового значения

Создайте функцию readNumber, которая будет запрашивать ввод числового значения до тех пор, пока посетитель его не введёт.

Функция должна возвращать числовое значение.

Также надо разрешить пользователю остановить процесс ввода, отправив пустую строку или нажав «Отмена». В этом случае функция должна вернуть null.
*/

function readNumber(){
    let num;
    do {
        num = prompt( 'Введите число' );
    } while ( num && isNaN(num) ); // num равно false, если мы ввели в prompt пустую строку, или нажали "Отмена" (null)

    if (num === '' || num === null) return null; // по условию задачи при пустой строке или null надо вернуть null

    return +num;
}

alert( readNumber() );